app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id] && !Artist.find_by_id(params[:artist_id])
      flash[:notice] =   "Artist not found."
      redirect_to artists_path
    elsif params[:artist_id] && Artist.find_by_id(params[:artist_id])
      @songs = Artist.find(params[:artist_id]).songs
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
---
  def show
    if params[:artist_id] && !Song.find_by_id(params[:id])
      flash[:notice] =  "Song not found."
      redirect_to artist_songs_path(Artist.find(params[:artist_id]))